%TSP_GA Traveling Salesman Problem (TSP) Genetic Algorithm (GA)
clc % 清屏
clear all; % 删除workplace变量
close all; % 关掉显示图形窗口
tic
%n = 50;%城市的数量
%xy = 10*rand(n,2);%城市的位置坐标

%n=10;
%xy=[0.4 0.4439;0.2439 0.1463;0.1707 0.2293;0.2293 0.761;0.5171 0.9414;
 %      0.8732 0.6536;0.6878 0.5219;0.8488 0.3609;0.6683 0.2536;0.6195 0.2634];

%n=30时的结果
n=30;
xy=[41 94;37 84;54 67;25 62;7 64;2 99;68 58;71 44;54 62;83 69;64 60;18 54;22 60;
       83 46;91 38;25 38;24 42;58 69;71 71;74 78;87 76;18 40;13 40;82 7;62 32;58 35;45 21;41 26;44 35;4 50];

% n=50;
% xy=[31 32;32 39;40 30;37 69;27 68;37 52;38 46;31 62;30 48;21 47;25 55;16 57;
 %      17 63;42 41;17 33;25 32;5 64;8 52;12 42;7 38;5 25; 10 77;45 35;42 57;32 22;
 %       27 23;56 37;52 41;49 49;58 48;57 58;39 10;46 10;59 15;51 21;48 28;52 33;
  %    58 27;61 33;62 63;20 26;5 6;13 13;21 10;30 15;36 16;62 42;63 69;52 64;43 67];
%n=75;
%xy=[48 21;52 26;55 50;50 50;41 46;51 42;55 45;38 33;33 34;45 35;40 37;50 30;
 %     55 34;54 38;26 13;15 5;21 48;29 39;33 44;15 19;16 19;12 17;50 40;22 53;21 36;
 %    20 30;26 29;40 20;36 26;62 48;67 41;62 35;65 27;62 24;55 20;35 51;30 50;
 %   45 42;21 45;36 6;6 25;11 28;26 59;30 60;22 22;27 24;30 20;35 16;54 10;50 15;
 %    44 13;35 60;40 60;40 66;31 76;47 66;50 70;57 72;55 65;2 38;7 43;9 56;15 56;
  %    10 70;17 64;55 57;62 57;70 64;64 4;59 5;50 4;60 15;66 14;66 8;43 26];

popSize = 60;%种群的大小，一般被4整除
numIter = 1e4;%算法迭代的次数
showProg = 1;%如果满足条件，执行遗传算法的步骤
showResult = 1;%如果满足条件，执行遗传算法的结果
a = meshgrid(1:n);
dmat = reshape(sqrt(sum((xy(a,:)-xy(a',:)).^2,2)),n,n);%城市之间的距离/成本
[optRoute,minDist] = tsp_ga(xy,dmat,popSize,numIter,showProg,showResult);
%% Output:
% optRoute 遗传算法得出的最优路径
% minDist 最优路径下的成本值或距离值
%%

%figure,
%for i=1:n
 % hold on
 % plot(xy(:,1),xy(:,2),'k.');
 % text(xy(i,1),xy(i,2)+0.08,num2str(i));
%end
%for i=1:n-1
 %plot([xy(optRoute(1,i),1),xy(optRoute(1,i+1),1)],[xy(optRoute(1,i),2),xy(optRoute(1,i+1),2)])
 %hold on
%end
%for i=n
 %   plot([xy(optRoute(1,i),1),xy(optRoute(1,1),1)],[xy(optRoute(1,i),2),xy(optRoute(1,1),2)])
  %  hold on
%end
toc


